超越点调整、领邮箱、兑换神殿币、看苏生、看土块、


每日：生活技能
每周：圣物，周挑战，梦境+轮回，大冒险，森林，每周六家族本，奈落
外交：深渊守护者 消耗栏扩充，海妮 装备栏扩充，黑月公主 任务栏扩充
阿修斯 森生 爱德拉 BEN 梅丽莎 露娜 欧罗拉 海妮 黑月 玛丽
神魔   埃及           玛雅             深林 罗马 和风


--每周物品转移 半神
低级血脉水晶(可存仓);中级血脉水晶(可存仓);高级血脉水晶(可存仓);活动时空血脉水晶;钓鱼王称号书;钓鱼之神称号书;钓鱼达人称号书;钓鱼高手称号书;抽奖王称号;翠绿口香糖;虚实碎片;试炼蝴蝶结;繁星药剂;圣字 魔法伤害减少 重洗卷轴;圣字 武器攻击力 重洗卷轴;圣字 最大生命值 重洗卷轴;文明残页;文明水晶;圣字之火;圣字泛红圣遗物;圣字泛黄圣遗物;圣字泛蓝圣遗物;星海藤;流沙粉钻;卡伊洛斯的标徽;时之花;时之羽;巴巴托斯的长剑锯齿;米凯尔拉的花朵装饰;米凯尔拉的羽毛;巴巴托斯的特制炸弹;水晶流砂;粉晶落叶;高级召唤兽技能强化卷轴;小天使晶片;创意染色券;淘淘卡;淘淘卡兑换券;创意美发券;梦魇碎块;梦狱碎块;梦之放映机(不可交易);普通武器皮肤激活券;眼睛整容专家券;发型专家券;特殊发型券;特殊晒黑票券;特殊头发颜色券;特殊眼睛整形券;特殊彩色隐形眼镜券;彩虹标徽;春日小花朵;白金锤子;圣域圣神符文;圣域宝石 宝石魔法锤随机包;圣域宝石 重洗卷轴随机包;皮酷斯缝纫线板;闪耀翅膀碎片;基沙拉钥匙;灵魂的夙愿;复合觉醒石随机包;墨诺提的圣杯;弥修斯的愤怒;拉斐拉的羽毛装饰;伤痕之花;弥修斯的箱子;赫尔之戒碎片;银色原石;银色石板;神秘火苗(双刀);神秘火苗(双手剑);莱菲卡的红色珍宝;格莫瑞族女王的绿色珍宝;莱菲卡服饰兑换券;莱菲卡伤害皮肤装扮券(永久);扬卡什手套碎片;扬卡什尾巴;安德利亚之箭;安德利亚之断弓;神炼的多面头戴;上位蛇年小王子帽子;魔法的精粹者徽章+13;魔·冥界之翼;神·圣灵之拥;龙晶[青鸾];祈福同心+9;法老王的巨型宝石戒指;法老王的闪耀耳环;

索拉城 湛蓝硬币;索拉城硬币箱子;

--每周物品转移 环
低级血脉水晶(可存仓);中级血脉水晶(可存仓);高级血脉水晶(可存仓);活动时空血脉水晶;钓鱼王称号书;钓鱼之神称号书;钓鱼达人称号书;钓鱼高手称号书;抽奖王称号;翠绿口香糖;虚实碎片;试炼蝴蝶结;繁星药剂;圣字 魔法伤害减少 重洗卷轴;圣字 武器攻击力 重洗卷轴;圣字 最大生命值 宝石魔法锤;圣字 体力 重洗卷轴;高级召唤兽技能强化卷轴;小天使晶片;创意染色券;淘淘卡;淘淘卡兑换券;创意美发券;梦魇碎块;梦狱碎块;梦之放映机(不可交易);普通武器皮肤激活券;眼睛整容专家券;发型专家券;特殊发型券;特殊晒黑票券;特殊头发颜色券;特殊眼睛整形券;特殊彩色隐形眼镜券;彩虹标徽;春日小花朵;白金锤子;圣域圣神符文;圣域宝石 宝石魔法锤随机包;圣域宝石 重洗卷轴随机包;皮酷斯缝纫线板;闪耀翅膀碎片;基沙拉钥匙;灵魂的夙愿;复合觉醒石随机包;墨诺提的圣杯;弥修斯的愤怒;拉斐拉的羽毛装饰;伤痕之花;弥修斯的箱子;赫尔之戒碎片;银色原石;银色石板;神秘火苗(双刀);神秘火苗(双手剑);莱菲卡的红色珍宝;格莫瑞族女王的绿色珍宝;莱菲卡服饰兑换券;莱菲卡伤害皮肤装扮券(永久);扬卡什手套碎片;扬卡什尾巴;安德利亚之箭;安德利亚之断弓;神·圣灵之拥;魔·冥界之翼;LA-smile-笑脸(男)T恤;LA逐梦系列-夏の阳光(男)帽子;LA逐梦系列-夏の阳光(男)下衣;空灵披风·SPA队长;法老王的巨型宝石戒指;法老王的闪耀耳环;

--消耗栏
--血脉
混乱世界血脉水晶I;混乱世界血脉水晶II;混乱世界血脉水晶III;混乱世界血脉水晶IV;混乱世界血脉水晶V;混乱世界血脉水晶VI;混乱世界血脉水晶VII;混乱世界血脉水晶VIII;混乱世界血脉水晶IX;混乱世界血脉水晶X;低级血脉水晶(可存仓);中级血脉水晶(可存仓);高级血脉水晶(可存仓);活动时空血脉水晶;
--称号
钓鱼王称号书;钓鱼之神称号书;钓鱼达人称号书;钓鱼高手称号书;抽奖王称号;

--其他栏
翠绿口香糖;虚实碎片;试炼蝴蝶结;繁星药剂;圣字 魔法伤害减少 重洗卷轴;圣字 武器攻击力 重洗卷轴;圣字 最大生命值 重洗卷轴;文明残页;文明水晶;圣字之火;圣字泛红圣遗物;圣字泛黄圣遗物;圣字泛蓝圣遗物;星海藤;流沙粉钻;卡伊洛斯的标徽;时之花;时之羽;巴巴托斯的长剑锯齿;米凯尔拉的花朵装饰;米凯尔拉的羽毛;巴巴托斯的特制炸弹;水晶流砂;粉晶落叶;

--任务栏
--杂项 随机称号卷轴不可存 潜力灵龛不可存
高级召唤兽技能强化卷轴;小天使晶片;创意染色券;淘淘卡;淘淘卡兑换券;创意美发券;梦魇碎块;梦狱碎块;梦之放映机(不可交易);普通武器皮肤激活券;眼睛整容专家券;发型专家券;特殊发型券;特殊晒黑票券;特殊头发颜色券;特殊眼睛整形券;特殊彩色隐形眼镜券;彩虹标徽;春日小花朵;白金锤子;
--副本材料
圣域圣神符文;圣域宝石 宝石魔法锤随机包;圣域宝石 重洗卷轴随机包;皮酷斯缝纫线板;闪耀翅膀碎片;基沙拉钥匙;灵魂的夙愿;复合觉醒石随机包;墨诺提的圣杯;弥修斯的愤怒;拉斐拉的羽毛装饰;伤痕之花;弥修斯的箱子;赫尔之戒碎片;银色原石;银色石板;神秘火苗(双刀);神秘火苗(双手剑);莱菲卡的红色珍宝;格莫瑞族女王的绿色珍宝;莱菲卡服饰兑换券;莱菲卡伤害皮肤装扮券(永久);扬卡什手套碎片;扬卡什尾巴;安德利亚之箭;安德利亚之断弓;
--黄昏以上副本材料
安莎拉腰带装饰;基沙拉假火炬;基沙拉钥匙;安莎拉护手;拉斐拉的羽毛装饰;伤痕之花;弥修斯的愤怒;银色石板;银色原石;莱菲卡的红色珍宝;格莫瑞族女王的绿色珍宝;莱菲卡服饰兑换券;扬卡什手套碎片;安德利亚之箭;安德利亚之断弓;
--黄昏以下副本材料
皮酷斯针鞘;精灵之卵;突变藤蔓;圣之痕;利卡里亚的斧刃;利卡里亚的盔甲碎片;空灵花;莫尔迦娜的吊坠;火焰龙的角;莫德雷德的橙色蝴蝶结;皮酷斯的玩偶;塔米埃尔的眼罩;时之章;安莎拉腰带装饰;不稳定能量阵;时间长轴;金色圣杯;冰凝之蝶;

--半神经验套
神炼的多面头戴;上位蛇年小王子帽子;魔法的精粹者徽章+13;魔·冥界之翼;神·圣灵之拥;龙晶[青鸾];祈福同心+9;法老王的巨型宝石戒指;法老王的闪耀耳环;;;;;;;;;;;;;;;;元素之灵·超越符文+3;通灵领主·超越符文+3;巨星·超越符文+3;


--------------------------------------------------------------------------------------------------------------------------------
--可存仓经验药水
经验值的秘药 100%;经验值的秘药 200%;经验值的秘药 300%;经验值的秘药 800%;大红星;酬勤经验药水;恶魔の小果实（雾）;恶魔の小果实（火）;
--可存仓恢复药水
★ 大型葡萄药丸;★ 中型葡萄药丸;★ 小型葡萄药丸;
--糖果
甜蜜橙味全糖蜜果;紫葡萄味全糖蜜果;蓝草莓味全糖蜜果;红樱桃味全糖蜜果;青苹果味全糖蜜果;黄香蕉味全糖蜜果;
--灵魂碎片
企鹅元芳的灵魂碎片;小天使的灵魂碎片;理查德·帕克的灵魂碎片;修仙噗噗的灵魂碎片;大大熊的灵魂碎片;舞扇忍者的灵魂碎片;蘑菇鸡的灵魂碎片;成年男仆的灵魂碎片;太极熊猫的灵魂碎片;幻蓝行者的灵魂碎片;双头波比的灵魂碎片;可爱猫女郎的灵魂碎片;
--传奇觉醒材料
【觉醒】之核;【觉醒II】之核;【传奇】之核;【传奇】之羽;【传奇II】之核;【传奇II】之羽;
--羁绊礼盒
神魔羁绊礼盒;罗马羁绊礼盒;玛雅羁绊礼盒;埃及羁绊礼盒;和风羁绊礼盒;深林羁绊礼盒;乡村羁绊礼盒;银河羁绊礼盒;中华羁绊礼盒;皇室羁绊礼盒;
--剧场深渊材料
皮酷斯针鞘;皮酷斯的玩偶;皮酷斯缝纫线板;
--流水
女神雕像;巴比伦金球;太空玫瑰;密文石碑;永恒星辰服饰兑换券;绿洲水晶;
--时空穿梭
遗忘之源;冰凝之蝶;空灵花;不稳定能量阵;时之章;时空服饰兑换券;
--遗迹庭院
弥修斯的愤怒;时间长轴;拉斐拉的羽毛装饰;伤痕之花;
--精灵
拉尔沙之戒+2;拉尔沙之戒+1;拉尔沙之戒+3;拉尔沙之戒+4;拉尔沙之戒;
--时装
3星*白小飞下衣(7天);1星*美羊羊鞋子;1星*八神衣服;3星*草莓物语(帽子);1星*毛绒皮鞋;1星*毛绒皮帽;1星*毛绒短裤;1星*毛绒外套;
--钓鱼
会说话的黄鱼;牛奶色的鲤鱼;掉了牙齿的鲨鱼;大钳子;金色草鱼;
--觉醒箱子
觉醒·黄金混沌箱子;觉醒·黄金箱子;觉醒·黄金血脉箱子;
--环经验套
神·圣灵之拥;魔·冥界之翼;LA-smile-笑脸(男)T恤;LA逐梦系列-夏の阳光(男)帽子;LA逐梦系列-夏の阳光(男)下衣;空灵披风·SPA队长;法老王的巨型宝石戒指;法老王的闪耀耳环;
--符文
天穹卡牌师·超越符文;英雄·超越符文;圣十字军·超越符文;魔射手·超越符文;演奏大师·超越符文;史诗卡牌师·超越符文;恐怖骑士·超越符文;修行武者·超越符文;审判官·超越符文;剑圣·超越符文;风行刺客·超越符文;星芒骑士·超越符文;幻灵师·超越符文;刺杀者·超越符文;疾风舞者·超越符文;剑刃舞者·超越符文;黑影·超越符文;远古机甲师·超越符文;星能机师·超越符文;暗影行者·超越符文;逐暗者·超越符文;宝石星·超越符文;傀儡宗师·超越符文;阿格尼·超越符文;梦魇恶魔·超越符文;次元守望者·超越符文;武道宗师·超越符文;神之使者·超越符文;守护天使·超越符文;唤雨之灵·超越符文;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;通灵领主·超越符文;元素之灵·超越符文;巨星·超越符文;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;元素之灵·超越符文;元素之灵·超越符文+1;元素之灵·超越符文+2;巨星·超越符文;巨星·超越符文+1;巨星·超越符文+2;通灵领主·超越符文+1;通灵领主·超越符文;通灵领主·超越符文+2;
--魔法怪
别天神 阿努;青袍魔法师;紫袍魔法师;惨白罪人;绅士罪人;怒怒机器人;

--角色
10181788;﹎秋水伊人ゞ
19206593;于适
6367215;苍★龙
9857891;致今生
9915450;微风♀
4775863;呆小ˇ宝
11108979;晚来天欲雪o
10237665;小姐姐
11109355;能饮一杯无o
19674171;云青青兮欲雨
10335259;猫又*
10070705;年轮说
11080851;AntiMagic
11083254;你到底吻不吻我o
9927906;GD欢
19206593;狂暴小怪兽
10304843;酷狗音乐ā
11078750;他不会等你了
9892783;自然萌ご
9915450;微风♀
11078294;花市灯如昼っ
19173099;星光漫漫
10773699;温茶清风丶
19687266;晓芳
11079108;航·次元守望者
19681648;小野夕子
11089496;山有木兮卿有意
9704292;草木皆兵
10098693;ｖ天上白玉京＂
19697254;什方

﹎秋水伊人ゞ A96DC7EFCBAED2C1C8CBA967         --拼图
晚来天欲雪o CDEDC0B4CCECD3FBD1A96F
小姐姐 D7FAD7FAD7FAD7FAD7FAD0A1BDE3BDE3
云青青兮欲雨 D4C6C7E0C7E0D9E2D3FBD3EAFE5D
满船清梦压星河Q C2FAB4ACC7E5C3CED1B9D0C7BAD351    
能饮一杯无o C4DCD2FBD2BBB1ADCEDE6F            
醉后不知天在水o D7EDBAF3B2BBD6AACCECD4DACBAE6F --矿石
→酷我音乐→ A1FABFE1CED2D2F4C0D6A1FA           --垃圾时装 紫金 奈落下衣鞋 280探险家王者套 回声 圣皇 卡夫卡腕轮
酷狗音乐ā BFE1B9B7D2F4C0D6A8A1                --奈落相关材料|||传奇材料 奈落相关材料
℃ベ裸装 A1E6A5D9A8FDA8FDC2E3D7B0           --梦境材料
终不似o D6D5B2BBCBC66F                        --宠物口粮 神秘星能量 魔力养分 爱情礼盒 丝团|||野外切糕 水晶锤子 技之密保 星座神话箱
最是人间留不住o D7EECAC7C8CBBCE4C1F4B2BBD7A16F --称号书|||家族材料||| 索拉币 猫粮骨头 植物养分 宠物新秀币
水澹澹兮生烟 CBAEE5A3E5A3D9E2C9FAD1CCFE5D    --垃圾时装|||可存仓恢复药水 魔法时尚卡 任务奖励加成药 定位仪|||圣杯 繁星 蝴蝶结|||高收 灵魂碎片  黄昏以上副本材料
少年游o C9D9C4EAD3CE6F                       --垃圾时装 点墨|||可存仓经验药水 灰色称号书 ||| 时装拼图 高级拼图 超级拼图|||重置卷轴 神秘碎片 羁绊礼盒 黄昏以下副本材料 精英本材料
航·次元守望者 --杂物
摩羯0618 --拼图

你到底吻不吻我o C4E3B5BDB5D7CEC7B2BBCEC7CED26F
来去荒芜 C0B4C8A5BBC4CEDF                       --羁绊礼盒 觉醒箱子 苏生
我有药 CED2D3D0D2A9
不要碰我肩膀 B2BBD2AAC5F6CED2BCE7B0F2
陌辰 C4B0B3BD
惊觉 BEAABEF5FE5D                              --宠物口粮
心缩 D0C4CBF5                                   --星座|||索拉币 拼图重置卷
逾白 D3E2B0D7FE5D                              --家族材料
烟雨情相思 D7FAD1CCD3EAC7E9CFE0CBBCD7FA        --奈落相关材料 梦境材料
乙骨犹太 D2D2B9C7D3CCCCAB                        --可存仓经验药水|||灵魂碎片 神秘碎片 魔法时尚卡
荼茶 DDB1B2E8                                   --可存仓恢复药水|||时装拼图 高级拼图|||拼图礼罐 商城图鉴 精英本材料 秘源之星
鸦九 D1BBBEC5 --探险家 暗金 古代 狗托 火灵|||传奇觉醒材料 稀有交换券 家族水晶 家族徽标颜料 名片 技能强化卷
莫吵 C4AAB3B3 --垃圾时装 点墨 288套 邪语 回声|||圣杯 繁星 蝴蝶结|||黄昏以上副本材料
无心梦 CEDED0C4C3CE --垃圾时装 归墟套|||拼图镶嵌 矿石 鲜花|||黄昏以下副本材料

自然萌ご D7FCD7FCD7D4C8BBC3C8A4B4D7FC
十八岁青春男高 CAAEB0CBCBEAC7E0B4BAC4D0B8DF
雪绒薄荷ご D7FCD7FCD1A9C8DEB1A1BAC9A4B4
傻海我们走~ C9B5BAA3CED2C3C7D7DF7E
BaLl, 42614C6C2C
萌萌仓库-格挡 C3C8C3C8B2D6BFE22DB8F1B5B2      --可存仓经验药水|||高级拼图 灵魂碎片 觉醒材料
萌萌仓库-爆率 C3C8C3C8B2D6BFE22DB1ACC2CA      --樱花15 龙晶青鸾 垃圾特效 星座 超越手镯|||可存仓恢复药水|||时装拼图 副本材料 神秘碎片 标徽 奈落材料 召唤卷轴
芝士羊绒ご D7FCD7FCD6A5CABFD1F2C8DEA4B4     --垃圾时装 古代套 点墨套|||矿石 高级拼图 时装拼图 宠物口粮|||发型券 家族水晶 梦境材料
雪绒蓝莓ご D7FCD7FCD1A9C8DEC0B6DDAEA4B4     --破灭套 迷城勇士套 回声|||镶嵌药|||矿石 鲜花 爱情礼盒|||觉醒箱子 稀有交换券 家族徽标颜料 拼图重置卷

他不会等你了 CBFBB2BBBBE1B5C8C4E3C1CB
雾云川 CEEDD4C6B4A8


1416989835@qq.com
Zhou1997

yaofei8628207770
qwer1234

oyyx950307
18684847750

sjt635996125
sjt2211346
221134

c17688449971
123123333a

5oq57q

点击领取
鼠标移动 99 1000 690
左键按下 99 920 420
左键抬起 99 920 420

下一页
鼠标移动 99 980 550
左键按下 99 980 550
左键抬起 99 980 550

上一页
鼠标移动 99 920 550
左键按下 99 920 550
左键抬起 99 920 550

体力蛋糕
鼠标移动 99 980 450
左键按下 99 980 450
左键抬起 99 980 450

高级体力蛋糕 
鼠标移动 99 980 480
左键按下 99 980 480
左键抬起 99 980 480

魔法蛋糕
鼠标移动 99 920 380
左键按下 99 920 380
左键抬起 99 920 380

高级魔法蛋糕
鼠标移动 99 920 420
左键按下 99 920 420
左键抬起 99 920 420

复合蛋糕
鼠标移动 99 920 480
左键按下 99 920 480
左键抬起 99 920 480

高级复合蛋糕
鼠标移动 99 920 520
左键按下 99 920 520
左键抬起 99 920 520

购买按钮
鼠标移动 99 980 575
左键按下 99 980 575
左键抬起 99 980 575

-----------------------------制作免疫药品材料
鼠标移动 99 980 550
左键按下 99 980 550
左键抬起 99 980 550
鼠标移动 99 980 450
左键按下 99 980 450
左键抬起 99 980 450
鼠标移动 99 980 575
左键按下 99 980 575
左键抬起 99 980 575
鼠标移动 99 980 550
左键按下 99 980 550
左键抬起 99 980 550
鼠标移动 99 920 380
左键按下 99 920 380
左键抬起 99 920 380
鼠标移动 99 980 575
左键按下 99 980 575
左键抬起 99 980 575
鼠标移动 99 920 480
左键按下 99 920 480
左键抬起 99 920 480
鼠标移动 99 980 575
左键按下 99 980 575
左键抬起 99 980 575
鼠标移动 99 920 550
左键按下 99 920 550
左键抬起 99 920 550
鼠标移动 99 920 550
左键按下 99 920 550
左键抬起 99 920 550
-----------------------------制作小虹吸材料
鼠标移动 99 980 550
左键按下 99 980 550
左键抬起 99 980 550
鼠标移动 99 980 480
左键按下 99 980 480
左键抬起 99 980 480
鼠标移动 99 980 575
左键按下 99 980 575
左键抬起 99 980 575
鼠标移动 99 980 550
左键按下 99 980 550
左键抬起 99 980 550
鼠标移动 99 920 420
左键按下 99 920 420
左键抬起 99 920 420
鼠标移动 99 980 575
左键按下 99 980 575
左键抬起 99 980 575
鼠标移动 99 920 520
左键按下 99 920 520
左键抬起 99 920 520
鼠标移动 99 980 575
左键按下 99 980 575
左键抬起 99 980 575
鼠标移动 99 920 550
左键按下 99 920 550
左键抬起 99 920 550
鼠标移动 99 920 550
左键按下 99 920 550
左键抬起 99 920 550


用python pyqt5库写一个桌面GUI小程序,目标是帮我计算最佳分配方式。
我有n个技能点数,需要分配到各个属性,彼此互相影响,下面讲解每个属性：
最大伤害(每点效果是增加 1%最大伤害,最多1000点),每点需要点数3点。
最小伤害(每点效果是增加 1%最小伤害,最多1000点),每点需要点数3点。
暴击伤害(每点效果是增加 1%暴击伤害,最多1000点),每点需要点数3点。
武器属性力(每点效果是增加 1属性力,最多1000点),每点需要点数3点。
最小伤害换最大伤害(每点效果是最小伤害减少 5%,最大伤害增加 10%,最多250点),每点需要点数3点。
最终暴击伤害(每点效果默认增加 218%暴击伤害(可调整),最多40点),第一点需要2点,以后每点增加5点,也就是第二点需要7点,第三点需要12点以此类推。
最终最小伤害(每点效果默认增加 119%最小伤害(可调整),最多40点),第一点需要2点,以后每点增加5点,也就是第二点需要7点,第三点需要12点以此类推。
最终最大伤害(每点效果默认增加 143%最大伤害(可调整),最多40点),第一点需要2点,以后每点增加5点,也就是第二点需要7点,第三点需要12点以此类推。
超级武器属性力(每点效果默认增加 787属性力(可调整),最多20点),第一点需要10点,以后每点增加10点,也就是第二点需要20点,第三点需要30点以此类推。
最终造成的伤害公式是 属性力*暴击伤害*（最大伤害+最小伤害）/2 最终数值越高则越强
人物初始属性(可调整):
最大伤害初始值 17254%
最小伤害初始值 13289%
暴击伤害初始值 30282%
武器属性力初始值 94459
要求:
1.实际最小伤害不能超过实际最大伤害
2.有计算方案次数显示,尽量少的影响程序计算
3.用协程或者多线程或者异步方式来计算以避免阻塞主线程。
4.考虑PyQt类型转换问题,不要有数值溢出
5.最终属性的效果远比普通属性强大，可以考虑使用动态规划优化
6.尽量优化代码,减少计算时间
7.运用粗略搜索与精调搜索相结合的方式
8.提前剪枝
9.百分比分配策略
10.二分搜索优化最小换最大点数
11.减少迭代次数