裸装，心缩，秋意。蓝莓

血脉检查
梦灵检查
苏生补充
减伤药补充

超过每日/周进入次数.
武器8人n2 7连 6=2 123进组 来有点实力的
武器4人n2 7连 2=2 123进组
家族本n5 123进组
每日：生活技能
周一：圣物 大冒险 森林
周末：家族本 奈落 周挑战 梦境+轮回 装扮排行榜奖励

--缔造神话 航·次元守望者
--五哈家族 最是人间留不住 醉后不知天在水 ℃ベ裸装 终不似o    惊觉 乙骨犹太 心缩 荼茶 
初级活力水滴;中级冒险家情报卷轴;高级冒险家情报卷轴;智之石;智之石碎片;闪闪发光的宝箱;达人冒险家情报卷轴;初级冒险家情报卷轴;外交印章：朱雀;中级活力水滴;黄金魔方;大师冒险家情报卷轴;治愈的碎片结晶;冲突的碎片结晶;美丽的碎片结晶;活跃的碎片结晶;座之石;大师活力水滴;炽之石;

--没绿茶
酷我音乐
最是人间留不住o
水澹澹兮生烟
少年游o

不要碰我肩膀
逾白
陌辰
惊觉
心缩
鸦九
烟雨情相思
荼茶

--羁绊外交没满
秋水伊人       --爱德拉 ben
醉后不知天在水o --爱德拉 ben 露娜
最是人间留不住o --爱德拉 ben 露娜
水澹澹兮生烟  --爱德拉 ben
少年游o        --爱德拉 ben 露娜

--扩充没满
不要碰我肩膀   消耗5 任务5          差
逾白        装备6 消耗6 任务6     差
陌辰          消耗10 任务8         差
惊觉       装备3 消耗7 任务8      差               森生 --梅丽莎（家族外交等级不够）
乙骨犹太     消耗9 任务8            差--阿修斯   黑月 森生 梅丽莎
心缩        装备7 消耗7 任务6
鸦九         装备6 消耗5 任务7      差              森生 --梅丽莎（家族外交等级不够）
烟雨情相思  装备9 消耗7 任务8
荼茶         装备7 消耗7 任务7      差          --黑月 森生 梅丽莎（家族外交等级不够）

--#############################################################每周物品转移 store_items
神炼的多面头戴;上位蛇年小王子帽子;魔法的精粹者徽章+13;魔·冥界之翼;神·圣灵之拥;龙晶[青鸾];祈福同心+9;法老王的巨型宝石戒指;法老王的闪耀耳环;LA-smile-笑脸(男)T恤;LA逐梦系列-夏の阳光(男)帽子;LA逐梦系列-夏の阳光(男)下衣;空灵披风·SPA队长;贪婪耳环;贪婪披风;贪婪戒指;扬卡什胸针;低级血脉水晶(可存仓);中级血脉水晶(可存仓);高级血脉水晶(可存仓);活动时空血脉水晶;红樱桃味全糖蜜果;黄香蕉味全糖蜜果;甜蜜橙味全糖蜜果;合家欢全糖蜜果;恶魔の小果实（雾）;恶魔の小果实（火）;钓鱼王称号书;钓鱼之神称号书;钓鱼达人称号书;钓鱼高手称号书;抽奖王称号;翠绿口香糖;虚实碎片;试炼蝴蝶结;繁星药剂;圣字 魔法伤害减少 重洗卷轴;圣字 武器攻击力 重洗卷轴;圣字 最大生命值 重洗卷轴;文明残页;文明水晶;圣字之火;圣字泛红圣遗物;圣字泛黄圣遗物;圣字泛蓝圣遗物;星海藤;流沙粉钻;卡伊洛斯的标徽;时之花;时之羽;巴巴托斯的长剑锯齿;米凯尔拉的花朵装饰;米凯尔拉的羽毛;巴巴托斯的特制炸弹;水晶流砂;粉晶落叶;文明能量球;自旋星盘;阿柯奈斯头盔;努斯灵魂容器;普洛奈头盖;王者腕轮;蔚蓝龙珠;橙黄龙珠;多彩龙珠;抓不住的影子;神秘沙漏;神秘碎片;星星之源;技能强化卷轴;高级召唤兽技能强化卷轴;小天使晶片;创意染色券;淘淘卡;淘淘卡兑换券;创意美发券;梦魇碎块;梦狱碎块;梦之放映机(不可交易);普通武器皮肤激活券;眼睛整容专家券;发型专家券;特殊发型券;特殊晒黑票券;特殊头发颜色券;特殊眼睛整形券;特殊彩色隐形眼镜券;彩虹标徽;春日小花朵;白金锤子;武馆木牌;一级签到方块;二级签到方块;三级签到方块;梦灵成长属性转瓶;梦灵基础属性转瓶;【觉醒】之核;【觉醒II】之核;【传奇】之核;【传奇】之羽;【传奇II】之核;【传奇II】之羽;觉醒·黄金混沌箱子;觉醒·黄金箱子;觉醒·黄金血脉箱子;绵绵冰沙;童心碎片;未知森林伤害皮肤装扮券(永久）;名片装饰颜料（不可交易）;[活动]异世界结晶;跳跳糖果;索拉城硬币箱子;索拉城 湛蓝硬币;圣域圣神符文;圣域宝石 宝石魔法锤随机包;圣域宝石 重洗卷轴随机包;塔米埃尔的眼罩;皮酷斯针鞘;皮酷斯的玩偶;皮酷斯缝纫线板;格劳科斯发条键;思奇拉的玩偶帽子;思奇拉长靴碎片;格劳科斯之角;精灵之卵;闪耀翅膀碎片;圣之痕;利卡里亚的斧刃;利卡里亚的盔甲碎片;莫尔迦娜的吊坠;火焰龙的角;莫德雷德的橙色蝴蝶结;金色圣杯;安莎拉腰带装饰;基沙拉假火炬;基沙拉钥匙;安莎拉护手;拉斐拉的羽毛装饰;墨诺提的圣杯;伤痕之花;弥修斯的愤怒;弥修斯的箱子;时间长轴;破碎的驭魂兽精魄[镇寺兽];赫尔之戒碎片;银色石板;银色原石;神秘火苗(双刀);神秘火苗(双手剑);破碎的驭魂兽精魄[瑞贝特];莱菲卡的红色珍宝;格莫瑞族女王的绿色珍宝;莱菲卡服饰兑换券;莱菲卡伤害皮肤装扮券(永久);扬卡什手套碎片;安德利亚之箭;安德利亚之断弓;扬卡什尾巴;格诺西斯的领悟;N4-烬灭武器觉醒之石;N3-烬灭武器觉醒之石;N2-烬灭武器觉醒之石;不完整的魔神撕裂翅膀;格诺西斯的解放;不完整的魔神之角;;;;;;;;;;;;;;;;;;;;;;;突变藤蔓;符文之力;女神雕像;巴比伦金球;太空玫瑰;密文石碑;永恒星辰服饰兑换券;绿洲水晶;遗忘之源;冰凝之蝶;空灵花;不稳定能量阵;时之章;时空服饰兑换券;灵魂的夙愿;破碎的驭魂兽精魄[影魔];;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;复合觉醒石随机包;
--连体13取材料 黄昏以上副本材料 可存仓恢复药水 圣杯 蝴蝶结 羁绊礼盒 梦境材料
安莎拉腰带装饰;基沙拉假火炬;基沙拉钥匙;安莎拉护手;拉斐拉的羽毛装饰;墨诺提的圣杯;伤痕之花;弥修斯的愤怒;弥修斯的箱子;时间长轴;赫尔之戒碎片;银色石板;银色原石;神秘火苗(双刀);神秘火苗(双手剑);;莱菲卡服饰兑换券;莱菲卡伤害皮肤装扮券(永久);扬卡什手套碎片;安德利亚之箭;★ 大型葡萄药丸;★ 中型葡萄药丸;★ 小型葡萄药丸;试炼蝴蝶结;神魔羁绊礼盒;罗马羁绊礼盒;玛雅羁绊礼盒;埃及羁绊礼盒;和风羁绊礼盒;深林羁绊礼盒;乡村羁绊礼盒;银河羁绊礼盒;中华羁绊礼盒;皇室羁绊礼盒;梦魇碎块;梦狱碎块;
--连体14取材料 黄昏以下副本材料 可存仓经验药水 精英本材料 发型券 技能强化卷 小天使晶片
塔米埃尔的眼罩;皮酷斯针鞘;皮酷斯的玩偶;皮酷斯缝纫线板;精灵之卵;闪耀翅膀碎片;圣之痕;利卡里亚的斧刃;利卡里亚的盔甲碎片;空灵花;莫尔迦娜的吊坠;火焰龙的角;莫德雷德的橙色蝴蝶结;金色圣杯;突变藤蔓;女神雕像;巴比伦金球;太空玫瑰;密文石碑;永恒星辰服饰兑换券;绿洲水晶;遗忘之源;冰凝之蝶;空灵花;不稳定能量阵;时之章;时空服饰兑换券;灵魂的夙愿;破碎的驭魂兽精魄[影魔];经验值的秘药 100%;经验值的秘药 200%;大红星;酬勤经验药水;眼睛整容专家券;发型专家券;特殊发型券;特殊晒黑票券;特殊头发颜色券;特殊眼睛整形券;特殊彩色隐形眼镜券;技能强化卷轴;小天使晶片;
--自然萌吉他取材料
橙黄龙珠;蔚蓝龙珠;多彩龙珠;王者腕轮;神秘碎片;高级召唤兽技能强化卷轴;全塘蜜果礼盒;复合觉醒石随机包;圣字之火;圣字泛红圣遗物;圣字泛黄圣遗物;圣字泛蓝圣遗物;巴巴托斯的特制炸弹;米凯尔拉的花朵装饰;米凯尔拉的羽毛;翠绿口香糖;文明残页;水晶流砂;文明能量球;繁星药剂;卡伊洛斯的标徽;时之花;时之羽;巴巴托斯的长剑锯齿;文明水晶;自旋星盘;

------------------装备栏
--通用经验套
神炼的多面头戴;上位蛇年小王子帽子;魔法的精粹者徽章+13;魔·冥界之翼;神·圣灵之拥;龙晶[青鸾];祈福同心+9;法老王的巨型宝石戒指;法老王的闪耀耳环;LA-smile-笑脸(男)T恤;LA逐梦系列-夏の阳光(男)帽子;LA逐梦系列-夏の阳光(男)下衣;空灵披风·SPA队长;贪婪耳环;贪婪披风;贪婪戒指;扬卡什胸针;
------------------消耗栏
--血脉
混乱世界血脉水晶I;混乱世界血脉水晶II;混乱世界血脉水晶III;混乱世界血脉水晶IV;混乱世界血脉水晶V;混乱世界血脉水晶VI;混乱世界血脉水晶VII;混乱世界血脉水晶VIII;混乱世界血脉水晶IX;混乱世界血脉水晶X;低级血脉水晶(可存仓);中级血脉水晶(可存仓);高级血脉水晶(可存仓);活动时空血脉水晶;红樱桃味全糖蜜果;黄香蕉味全糖蜜果;甜蜜橙味全糖蜜果;合家欢全糖蜜果;恶魔の小果实（雾）;恶魔の小果实（火）;
--称号
钓鱼王称号书;钓鱼之神称号书;钓鱼达人称号书;钓鱼高手称号书;抽奖王称号;
------------------其他栏
翠绿口香糖;虚实碎片;试炼蝴蝶结;繁星药剂;圣字 魔法伤害减少 重洗卷轴;圣字 武器攻击力 重洗卷轴;圣字 最大生命值 重洗卷轴;文明残页;文明水晶;圣字之火;圣字泛红圣遗物;圣字泛黄圣遗物;圣字泛蓝圣遗物;星海藤;流沙粉钻;卡伊洛斯的标徽;时之花;时之羽;巴巴托斯的长剑锯齿;米凯尔拉的花朵装饰;米凯尔拉的羽毛;巴巴托斯的特制炸弹;水晶流砂;粉晶落叶;文明能量球;自旋星盘;阿柯奈斯头盔;努斯灵魂容器;普洛奈头盖;
------------------任务栏
--杂项 随机称号卷轴不可存 潜力灵龛不可存
王者腕轮;蔚蓝龙珠;橙黄龙珠;多彩龙珠;抓不住的影子;神秘沙漏;神秘碎片;星星之源;技能强化卷轴;高级召唤兽技能强化卷轴;小天使晶片;创意染色券;淘淘卡;淘淘卡兑换券;创意美发券;梦魇碎块;梦狱碎块;梦之放映机(不可交易);普通武器皮肤激活券;眼睛整容专家券;发型专家券;特殊发型券;特殊晒黑票券;特殊头发颜色券;特殊眼睛整形券;特殊彩色隐形眼镜券;彩虹标徽;春日小花朵;白金锤子;武馆木牌;一级签到方块;二级签到方块;三级签到方块;梦灵成长属性转瓶;梦灵基础属性转瓶;【觉醒】之核;【觉醒II】之核;【传奇】之核;【传奇】之羽;【传奇II】之核;【传奇II】之羽;觉醒·黄金混沌箱子;觉醒·黄金箱子;觉醒·黄金血脉箱子;绵绵冰沙;童心碎片;未知森林伤害皮肤装扮券(永久）;名片装饰颜料（不可交易）;[活动]异世界结晶;跳跳糖果;
--副本材料
索拉城硬币箱子;索拉城 湛蓝硬币;圣域圣神符文;圣域宝石 宝石魔法锤随机包;圣域宝石 重洗卷轴随机包;塔米埃尔的眼罩;皮酷斯针鞘;皮酷斯的玩偶;皮酷斯缝纫线板;格劳科斯发条键;思奇拉的玩偶帽子;思奇拉长靴碎片;格劳科斯之角;精灵之卵;闪耀翅膀碎片;圣之痕;利卡里亚的斧刃;利卡里亚的盔甲碎片;莫尔迦娜的吊坠;火焰龙的角;莫德雷德的橙色蝴蝶结;金色圣杯;安莎拉腰带装饰;基沙拉假火炬;基沙拉钥匙;安莎拉护手;拉斐拉的羽毛装饰;墨诺提的圣杯;伤痕之花;弥修斯的愤怒;弥修斯的箱子;时间长轴;破碎的驭魂兽精魄[镇寺兽];赫尔之戒碎片;银色石板;银色原石;神秘火苗(双刀);神秘火苗(双手剑);破碎的驭魂兽精魄[瑞贝特];莱菲卡的红色珍宝;格莫瑞族女王的绿色珍宝;莱菲卡服饰兑换券;莱菲卡伤害皮肤装扮券(永久);扬卡什手套碎片;安德利亚之箭;安德利亚之断弓;扬卡什尾巴;格诺西斯的领悟;N4-烬灭武器觉醒之石;N3-烬灭武器觉醒之石;N2-烬灭武器觉醒之石;不完整的魔神撕裂翅膀;格诺西斯的解放;不完整的魔神之角;;;;;;;;;;;;;;;;;;;;;;;突变藤蔓;符文之力;女神雕像;巴比伦金球;太空玫瑰;密文石碑;永恒星辰服饰兑换券;绿洲水晶;遗忘之源;冰凝之蝶;空灵花;不稳定能量阵;时之章;时空服饰兑换券;灵魂的夙愿;破碎的驭魂兽精魄[影魔];;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;复合觉醒石随机包;
--#############################################################
--可存仓经验药水
经验值的秘药 100%;经验值的秘药 200%;经验值的秘药 300%;经验值的秘药 800%;大红星;酬勤经验药水;恶魔の小果实（雾）;恶魔の小果实（火）;
--可存仓恢复药水
★ 大型葡萄药丸;★ 中型葡萄药丸;★ 小型葡萄药丸;
--糖果
青苹果味全糖蜜果;紫葡萄味全糖蜜果;蓝草莓味全糖蜜果;红樱桃味全糖蜜果;黄香蕉味全糖蜜果;甜蜜橙味全糖蜜果;合家欢全糖蜜果
--灵魂碎片
企鹅元芳的灵魂碎片;小天使的灵魂碎片;理查德·帕克的灵魂碎片;修仙噗噗的灵魂碎片;大大熊的灵魂碎片;舞扇忍者的灵魂碎片;蘑菇鸡的灵魂碎片;成年男仆的灵魂碎片;太极熊猫的灵魂碎片;幻蓝行者的灵魂碎片;双头波比的灵魂碎片;可爱猫女郎的灵魂碎片;
--羁绊礼盒
神魔羁绊礼盒;罗马羁绊礼盒;玛雅羁绊礼盒;埃及羁绊礼盒;和风羁绊礼盒;深林羁绊礼盒;乡村羁绊礼盒;银河羁绊礼盒;中华羁绊礼盒;皇室羁绊礼盒;
--发型券
眼睛整容专家券;发型专家券;特殊发型券;特殊晒黑票券;特殊头发颜色券;特殊眼睛整形券;特殊彩色隐形眼镜券;
--精灵
拉尔沙之戒+2;拉尔沙之戒+1;拉尔沙之戒+3;拉尔沙之戒+4;拉尔沙之戒;
--钓鱼
会说话的黄鱼;牛奶色的鲤鱼;掉了牙齿的鲨鱼;大钳子;金色草鱼;
--觉醒箱子
觉醒·黄金混沌箱子;觉醒·黄金箱子;觉醒·黄金血脉箱子;
--符文
天穹卡牌师·超越符文;英雄·超越符文;圣十字军·超越符文;魔射手·超越符文;演奏大师·超越符文;史诗卡牌师·超越符文;恐怖骑士·超越符文;修行武者·超越符文;审判官·超越符文;剑圣·超越符文;风行刺客·超越符文;星芒骑士·超越符文;幻灵师·超越符文;刺杀者·超越符文;疾风舞者·超越符文;剑刃舞者·超越符文;黑影·超越符文;远古机甲师·超越符文;星能机师·超越符文;暗影行者·超越符文;逐暗者·超越符文;宝石星·超越符文;傀儡宗师·超越符文;阿格尼·超越符文;梦魇恶魔·超越符文;次元守望者·超越符文;武道宗师·超越符文;神之使者·超越符文;守护天使·超越符文;唤雨之灵·超越符文;辉耀剑神·超越符文;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;通灵领主·超越符文;元素之灵·超越符文;巨星·超越符文;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;元素之灵·超越符文;元素之灵·超越符文+1;元素之灵·超越符文+2;巨星·超越符文;巨星·超越符文+1;巨星·超越符文+2;通灵领主·超越符文+1;通灵领主·超越符文;通灵领主·超越符文+2;
--时空秘境生活材料
卡南斯吉他;纳尔科的夹克;贵族梦魔的长靴;影之头盔;卡马里埃的破碎头盔;古拉卡布的宝石装饰;夏腊的骨头装饰面具;冰獭的沙丁鱼;冰獭的冰方块;雪人的护目镜帽子;纳尔科的煤油灯;影之弓箭;时空之芯;鹰眼石;雪人的眼镜;雪人的木条;温迪戈受诅咒的冰枪;萨马尔的陈旧披风;奈兮莫特的角笛;王高美之杖;贪吃的垃圾袋;凶灵的灵魂剑;玩偶绅士胡须;贵族梦魔的腰带装饰;皮格玛海盗熊兜帽;小艾因霍恩的角;波卡洛水桶;夏腊的盔甲面具;纳尔科的魔杖;波卡洛肥皂泡玩具;影之羽;卡马里埃的西装;时之花蕾;凶灵的死神长袍;巨人锤的拐杖;迪艾斯的盔甲;追踪者的白色尾巴;净化水滴;吸血鬼的焊接面罩;玩偶绅士假发;黑色条纹袜;吸血鬼的长袍;追踪者的蓝色尾巴;战兔头盔;巴甫洛汪盔甲;卡马里埃的毛衣;夏腊的锯齿羽翼;塔里埃尔的虫蛀苹果;统治者红角碎片;统治者蓝角碎片;皮格玛拼布兔兜帽;吸血鬼的盘子;胖丁的心形尾巴;高美女的丝带;花纹袜;红色条纹袜;幻兽骨弓;鹦鹉执事的扫帚;吉里温的钝器;卡南斯耳机;影之嫩芽;波雷亚斯的脚镣;波雷亚斯的锁链;火狐的冰棱枪;小艾因霍恩的尾毛;纳尔科的眼罩;火狐的项链;火狐的火尾;小艾因霍恩的吊坠;冰獭的水枪;统治者黑翼;灰玛瑙;波雷亚斯的冰棱胡须;蕴含魔石之力的吊坠;皮格玛猫咪兜帽;烟水晶;四爪草;卡南斯太阳镜;温迪戈受诅咒的冰箭;莫斯王国骑士手套;狼鞍;薛定喵的扫帚;温迪戈受诅咒的冰盾;海盗飞猪的红色围巾;阿纽斯的旗帜;特雷门德靠垫;蕴含魔石之力的手镯;胖丁的小角;追踪者的红色尾巴;消极的心;贵族梦魔的限定版鞭子;高美男的特别扣子;海盗飞猪的红色围巾;莫斯王国骑士手套;达纳米斯蝴蝶结;
--次元裂缝生活材料
追踪者的挡风镜;胖丁假面;猫眼石;安度西亚的红色燕尾服;西亚斯的头盔;帕皮亚斯的战斗食粮;鲁鲁帕的粉角;净化的水滴;水源犰狳的金色脚爪;西亚斯的石盾;安度西亚的小提琴弓;薇薇安娜的盾牌;基勒萨的饼干;硬硬章鱼;透亮海星;参花甲的药草;过期的罐头;岩石鳗;绯红幽兰;黑纹击退乌贼;海樱桃;迷你鲸鱼蛋;帕鲁鲁的花;薇薇安娜的盾牌;河马马的花冠;西亚斯的蓝色披风;艾奥纳的尾毛;科尔甲钻头;刺团的蝴蝶结;黄铜圣杯;科尔甲的枪;缟玛瑙;虎眼石;沉梦花;枯树枝;赫隆蛛之眼;薇薇安娜的流星锤;未知护甲;河马马的王冠;参花甲的白花;水滴眼泪;自由蛙;河马马的帽子;水晶海参;奥维的半身裙;

﹎秋水伊人ゞ     A96DC7EFCBAED2C1C8CBA967         --宠物口粮 拼图 重置卷轴 野外切糕 水晶锤子 技之密保 高收 星座神话箱
晚来天欲雪o     CDEDC0B4CCECD3FBD1A96F
小姐姐     D7FAD7FAD7FAD7FAD7FAD0A1BDE3BDE3
云青青兮欲雨   D4C6C7E0C7E0D9E2D3FBD3EAFE5D
满船清梦压星河Q  C2FAB4ACC7E5C3CED1B9D0C7BAD351    
能饮一杯无o     C4DCD2FBD2BBB1ADCEDE6F            
醉后不知天在水o  D7EDBAF3B2BBD6AACCECD4DACBAE6F 
→酷我音乐→      A1FABFE1CED2D2F4C0D6A1FA           --垃圾时装 紫金 奈落下衣鞋 280探险家王者套 回声 圣皇 卡夫卡腕轮
酷狗音乐ā       BFE1B9B7D2F4C0D6A8A1                
℃ベ裸装      A1E6A5D9A8FDA8FDC2E3D7B0           
终不似o         D6D5B2BBCBC66F                        --丝团|||灵魂碎片
最是人间留不住o  D7EECAC7C8CBBCE4C1F4B2BBD7A16F --家族材料|||神秘碎片
水澹澹兮生烟   CBAEE5A3E5A3D9E2C9FAD1CCFE5D    --垃圾时装|||矿石|||黄昏以上副本材料
少年游o         C9D9C4EAD3CE6F                       --垃圾时装 垃圾装备|||时装拼图 高级拼图 超级拼图 圣字材料|||黄昏以下副本材料 精英本材料
航·次元守望者 --杂物
摩羯0618 --拼图

你到底吻不吻我o C4E3B5BDB5D7CEC7B2BBCEC7CED26F
来去荒芜 C0B4C8A5BBC4CEDF                       --家族材料|||苏生 秘源之星 灵魂碎片 稀有交换券 家族水晶 家族徽标颜料 名片 魔法时尚卡
不要碰我肩膀 B2BBD2AAC5F6CED2BCE7B0F2
逾白 D3E2B0D7FE5D                              --梦境材料
陌辰 C4B0B3BD
我有药 CED2D3D0D2A9
惊觉 BEAABEF5FE5D                              --宠物口粮
乙骨犹太 D2D2B9C7D3CCCCAB                        --神秘碎片 
心缩 D0C4CBF5                                   --星座|||重置卷轴
鸦九 D1BBBEC5                                   --探险家 暗金 古代 狗托 火灵|||传奇觉醒材料 索拉币 技能强化卷轴
烟雨情相思 D7FAD1CCD3EAC7E9CFE0CBBCD7FA        --奈落相关材料
荼茶 DDB1B2E8                                   --时装拼图 高级拼图|||拼图礼罐 商城图鉴
莫吵 C4AAB3B3                                   --垃圾时装 垃圾装备|||可存仓恢复药水|||圣杯 蝴蝶结|||黄昏以上副本材料
无心梦 CEDED0C4C3CE                              --垃圾时装 垃圾装备|||可存仓经验药水|||拼图镶嵌 矿石 鲜花|||黄昏以下副本材料 精英本材料

自然萌ご D7FCD7FCD7D4C8BBC3C8A4B4D7FC
十八岁青春男高 CAAEB0CBCBEAC7E0B4BAC4D0B8DF
雪绒薄荷ご D7FCD7FCD1A9C8DEB1A1BAC9A4B4
傻海我们走~ C9B5BAA3CED2C3C7D7DF7E
BaLl, 42614C6C2C
蓝莓ご D7FCD7FCC0B6DDAEA4B4
羊绒芝士ご D7FCD7FCD1F2C8DED6A5CABFA4B4D7FC --奈落材料 召唤卷轴
羊绒芝士ご D7FCD7FCD1F2C8DED6A5CABFA4B4
雪绒蓝莓ご D7FCD7FCD1A9C8DEC0B6DDAEA4B4     --破灭套 迷城勇士套 回声|||镶嵌药|||矿石 鲜花 爱情礼盒|||稀有交换券 家族徽标颜料 拼图重置卷
芝士羊绒ご D7FCD7FCD6A5CABFD1F2C8DEA4B4     --垃圾时装 古代套 点墨套|||矿石 高级拼图 时装拼图 宠物口粮|||家族水晶
薄荷ご D7FCD7FCB1A1BAC9A4B4                --黄昏以上副本材料
boll 626F6C6C                               --黄昏以下副本材料
萌萌仓库-爆率 C3C8C3C8B2D6BFE22DB1ACC2CA      --樱花15 龙晶青鸾 垃圾特效 星座 超越手镯|||可存仓恢复药水 扩充仓库|||时装拼图|||神秘碎片 标徽 苏生 羁绊礼盒
萌萌仓库-格挡 C3C8C3C8B2D6BFE22DB8F1B5B2      --可存仓经验药水|||高级拼图|||灵魂碎片 觉醒材料 大冒险道具

龙卷风摧毁停車场 C1FABEEDB7E7B4DDBBD9CDA3DC87B3A1
玫瑰花的梦 C3B5B9E5BBA8B5C4C3CE
弥猫深巷離人心 C3D6C3A8C9EECFEFD7FCEB78C8CBD0C4
秋意也泛舟 C7EFD2E2D2B2B7BAD6DB
若惊鸿一梦 C8F4BEAABAE8D2BBC3CE
山有木兮卿有意 C9BDD3D0C4BED9E2D7FCC7E4D3D0D2E2
诉萌 CBDFC3C8
糯米Nomi D7FCC5B4C3D7D7FC4E6F6D69D7FC

他不会等你了 CBFBB2BBBBE1B5C8C4E3C1CB


1416989835@qq.com
Zhou1997

--要飞
yaofei8628207770
qwer1234

--项王
oyyx950307
18684847750

--宋炯涛
sjt635996125
sjt2211346
221134

--狗屎瓜
255724

c17688449971
123123333a

5oq57q


--贝罗斯
阿修斯 --神魔羁绊礼盒 羁绊之心
巴尔特 --强化成功率
菲薄 --普通武器激活券
--艾利亚斯
海妮 --深林羁绊礼盒 装备栏扩充
西门宏 --生活技能成功率
小四 --经验值加成
--上京
深渊守护者 --消耗栏扩充
肖维尔 --提升属性力
--奥义齐
黑月公主 --罗马羁绊礼盒 任务栏扩充
基恩 --提升武器攻击力
--艾尔法
爱莎 --提升魔法暴击率
玛丽 --和风羁绊礼盒
幸卓 --超能任务重置
--贝斯
森生  --埃及羁绊礼盒 羁绊之心
加内斯 --提升物理暴击率
--银色住宅
--联合工会
--塞丽娜城
爱德拉 --羁绊之心
BEN  --羁绊之心
--德鲁里吉
费迪南德 --超能点
贝利塔 --物品掉落率
梅丽莎 --玛雅羁绊礼盒 羁绊之心
--比格爱特
杰瑞 --普通发型永久券
艾妮 --物理最大
--尘世城
索尔 --魔法最大
露娜 --羁绊之心
考迪利亚 --其他栏扩充 名片 恶魔果实 人品衣服
欧罗拉 --神秘沙漏

--------------------------商店购买操作
--点击领取
鼠标移动 99 1000 690
左键按下 99 920 420
左键抬起 99 920 420
--点击下一页
鼠标移动 99 980 550
左键按下 99 980 550
左键抬起 99 980 550
--点击上一页
鼠标移动 99 920 550
左键按下 99 920 550
左键抬起 99 920 550
--点击体力蛋糕
鼠标移动 99 980 450
左键按下 99 980 450
左键抬起 99 980 450
--点击高级体力蛋糕 
鼠标移动 99 980 480
左键按下 99 980 480
左键抬起 99 980 480
--点击魔法蛋糕
鼠标移动 99 920 380
左键按下 99 920 380
左键抬起 99 920 380
--点击高级魔法蛋糕
鼠标移动 99 920 420
左键按下 99 920 420
左键抬起 99 920 420
--点击复合蛋糕
鼠标移动 99 920 480
左键按下 99 920 480
左键抬起 99 920 480
--点击高级复合蛋糕
鼠标移动 99 920 520
左键按下 99 920 520
左键抬起 99 920 520
--点击购买按钮
鼠标移动 99 980 575
左键按下 99 980 575
左键抬起 99 980 575
-----------------------------制作免疫药品材料
鼠标移动 99 980 550
左键按下 99 980 550
左键抬起 99 980 550
鼠标移动 99 980 450
左键按下 99 980 450
左键抬起 99 980 450
鼠标移动 99 980 575
左键按下 99 980 575
左键抬起 99 980 575
鼠标移动 99 980 550
左键按下 99 980 550
左键抬起 99 980 550
鼠标移动 99 920 380
左键按下 99 920 380
左键抬起 99 920 380
鼠标移动 99 980 575
左键按下 99 980 575
左键抬起 99 980 575
鼠标移动 99 920 480
左键按下 99 920 480
左键抬起 99 920 480
鼠标移动 99 980 575
左键按下 99 980 575
左键抬起 99 980 575
鼠标移动 99 920 550
左键按下 99 920 550
左键抬起 99 920 550
鼠标移动 99 920 550
左键按下 99 920 550
左键抬起 99 920 550
-----------------------------制作小虹吸材料
鼠标移动 99 980 550
左键按下 99 980 550
左键抬起 99 980 550
鼠标移动 99 980 480
左键按下 99 980 480
左键抬起 99 980 480
鼠标移动 99 980 575
左键按下 99 980 575
左键抬起 99 980 575
鼠标移动 99 980 550
左键按下 99 980 550
左键抬起 99 980 550
鼠标移动 99 920 420
左键按下 99 920 420
左键抬起 99 920 420
鼠标移动 99 980 575
左键按下 99 980 575
左键抬起 99 980 575
鼠标移动 99 920 520
左键按下 99 920 520
左键抬起 99 920 520
鼠标移动 99 980 575
左键按下 99 980 575
左键抬起 99 980 575
鼠标移动 99 920 550
左键按下 99 920 550
左键抬起 99 920 550
鼠标移动 99 920 550
左键按下 99 920 550
左键抬起 99 920 550

----------------------激活普通武器皮肤
--点击右上角武器皮肤
鼠标移动 99 850 450
左键按下 99 850 450
左键抬起 99 850 450
--选中武器皮肤券
鼠标移动 99 1150 380
左键按下 99 1150 380
左键抬起 99 1150 380
--点击购买
鼠标移动 99 1350 310
左键按下 99 1350 310
左键抬起 99 1350 310
--点击确认
鼠标移动 99 750 600
左键按下 99 750 600
左键抬起 99 750 600
-----------------------激活普通武器皮肤
鼠标移动 99 850 450
左键按下 99 850 450
左键抬起 99 850 450
鼠标移动 99 1150 380
左键按下 99 1150 380
左键抬起 99 1150 380
鼠标移动 99 1350 310
左键按下 99 1350 310
左键抬起 99 1350 310
鼠标移动 99 750 600
左键按下 99 750 600
左键抬起 99 750 600

----------------------领取探险家协会奖励
--点击探险家协会
鼠标移动 99 1690 1020
左键按下 99 1690 1020
左键抬起 99 1690 1020
--上一页X10
鼠标移动 99 715 605
左键按下 99 715 605
左键抬起 99 715 605
--领取 每个加100
鼠标移动 99 775 665
左键按下 99 775 665
左键抬起 99 775 665
--选第一个
鼠标移动 99 875 665
左键按下 99 875 665
左键抬起 99 875 665
--下一页
鼠标移动 99 1240 605
左键按下 99 1240 605
左键抬起 99 1240 605

---------------------领取探险家协会奖励
鼠标移动 99 715 605
左键按下 99 715 605
左键抬起 99 715 605
鼠标移动 99 715 605
左键按下 99 715 605
左键抬起 99 715 605
鼠标移动 99 715 605
左键按下 99 715 605
左键抬起 99 715 605
鼠标移动 99 715 605
左键按下 99 715 605
左键抬起 99 715 605
鼠标移动 99 715 605
左键按下 99 715 605
左键抬起 99 715 605
鼠标移动 99 715 605
左键按下 99 715 605
左键抬起 99 715 605
鼠标移动 99 715 605
左键按下 99 715 605
左键抬起 99 715 605
鼠标移动 99 715 605
左键按下 99 715 605
左键抬起 99 715 605
鼠标移动 99 715 605
左键按下 99 715 605
左键抬起 99 715 605
鼠标移动 99 715 605
左键按下 99 715 605
左键抬起 99 715 605
鼠标移动 99 775 665
左键按下 99 775 665
左键抬起 99 775 665
鼠标移动 99 875 665
左键按下 99 875 665
左键抬起 99 875 665
鼠标移动 99 875 665
左键按下 99 875 665
左键抬起 99 875 665
鼠标移动 99 875 665
左键按下 99 875 665
左键抬起 99 875 665
鼠标移动 99 975 665
左键按下 99 975 665
左键抬起 99 975 665
鼠标移动 99 875 665
左键按下 99 875 665
左键抬起 99 875 665
鼠标移动 99 1075 665
左键按下 99 1075 665
左键抬起 99 1075 665
鼠标移动 99 875 665
左键按下 99 875 665
左键抬起 99 875 665
鼠标移动 99 1175 665
左键按下 99 1175 665
左键抬起 99 1175 665
鼠标移动 99 875 665
左键按下 99 875 665
左键抬起 99 875 665
鼠标移动 99 1240 605
左键按下 99 1240 605
左键抬起 99 1240 605
鼠标移动 99 775 665
左键按下 99 775 665
左键抬起 99 775 665
鼠标移动 99 875 665
左键按下 99 875 665
左键抬起 99 875 665
鼠标移动 99 875 665
左键按下 99 875 665
左键抬起 99 875 665
鼠标移动 99 875 665
左键按下 99 875 665
左键抬起 99 875 665
鼠标移动 99 975 665
左键按下 99 975 665
左键抬起 99 975 665
鼠标移动 99 875 665
左键按下 99 875 665
左键抬起 99 875 665
鼠标移动 99 1075 665
左键按下 99 1075 665
左键抬起 99 1075 665
鼠标移动 99 875 665
左键按下 99 875 665
左键抬起 99 875 665
鼠标移动 99 1175 665
左键按下 99 1175 665
左键抬起 99 1175 665
鼠标移动 99 875 665
左键按下 99 875 665
左键抬起 99 875 665
鼠标移动 99 1240 605
左键按下 99 1240 605
左键抬起 99 1240 605
鼠标移动 99 775 665
左键按下 99 775 665
左键抬起 99 775 665
鼠标移动 99 875 665
左键按下 99 875 665
左键抬起 99 875 665
鼠标移动 99 875 665
左键按下 99 875 665
左键抬起 99 875 665
鼠标移动 99 875 665
左键按下 99 875 665
左键抬起 99 875 665
鼠标移动 99 975 665
左键按下 99 975 665
左键抬起 99 975 665
鼠标移动 99 875 665
左键按下 99 875 665
左键抬起 99 875 665
鼠标移动 99 1075 665
左键按下 99 1075 665
左键抬起 99 1075 665
鼠标移动 99 875 665
左键按下 99 875 665
左键抬起 99 875 665
鼠标移动 99 1175 665
左键按下 99 1175 665
左键抬起 99 1175 665
鼠标移动 99 875 665
左键按下 99 875 665
左键抬起 99 875 665
鼠标移动 99 1240 605
左键按下 99 1240 605
左键抬起 99 1240 605
鼠标移动 99 775 665
左键按下 99 775 665
左键抬起 99 775 665
鼠标移动 99 875 665
左键按下 99 875 665
左键抬起 99 875 665
鼠标移动 99 875 665
左键按下 99 875 665
左键抬起 99 875 665
鼠标移动 99 875 665
左键按下 99 875 665
左键抬起 99 875 665
鼠标移动 99 975 665
左键按下 99 975 665
左键抬起 99 975 665
鼠标移动 99 875 665
左键按下 99 875 665
左键抬起 99 875 665
鼠标移动 99 1075 665
左键按下 99 1075 665
左键抬起 99 1075 665
鼠标移动 99 875 665
左键按下 99 875 665
左键抬起 99 875 665
鼠标移动 99 1175 665
左键按下 99 1175 665
左键抬起 99 1175 665
鼠标移动 99 875 665
左键按下 99 875 665
左键抬起 99 875 665
鼠标移动 99 1240 605
左键按下 99 1240 605
左键抬起 99 1240 605
鼠标移动 99 775 665
左键按下 99 775 665
左键抬起 99 775 665
鼠标移动 99 875 665
左键按下 99 875 665
左键抬起 99 875 665
鼠标移动 99 875 665
左键按下 99 875 665
左键抬起 99 875 665
鼠标移动 99 875 665
左键按下 99 875 665
左键抬起 99 875 665
鼠标移动 99 975 665
左键按下 99 975 665
左键抬起 99 975 665
鼠标移动 99 875 665
左键按下 99 875 665
左键抬起 99 875 665
鼠标移动 99 1075 665
左键按下 99 1075 665
左键抬起 99 1075 665
鼠标移动 99 875 665
左键按下 99 875 665
左键抬起 99 875 665
鼠标移动 99 1175 665
左键按下 99 1175 665
左键抬起 99 1175 665
鼠标移动 99 875 665
左键按下 99 875 665
左键抬起 99 875 665
鼠标移动 99 1240 605
左键按下 99 1240 605
左键抬起 99 1240 605
鼠标移动 99 775 665
左键按下 99 775 665
左键抬起 99 775 665
鼠标移动 99 875 665
左键按下 99 875 665
左键抬起 99 875 665
鼠标移动 99 875 665
左键按下 99 875 665
左键抬起 99 875 665
鼠标移动 99 875 665
左键按下 99 875 665
左键抬起 99 875 665
鼠标移动 99 975 665
左键按下 99 975 665
左键抬起 99 975 665
鼠标移动 99 875 665
左键按下 99 875 665
左键抬起 99 875 665
鼠标移动 99 1075 665
左键按下 99 1075 665
左键抬起 99 1075 665
鼠标移动 99 875 665
左键按下 99 875 665
左键抬起 99 875 665
鼠标移动 99 1175 665
左键按下 99 1175 665
左键抬起 99 1175 665
鼠标移动 99 875 665
左键按下 99 875 665
左键抬起 99 875 665
鼠标移动 99 1240 605
左键按下 99 1240 605
左键抬起 99 1240 605
鼠标移动 99 775 665
左键按下 99 775 665
左键抬起 99 775 665
鼠标移动 99 875 665
左键按下 99 875 665
左键抬起 99 875 665
鼠标移动 99 875 665
左键按下 99 875 665
左键抬起 99 875 665
鼠标移动 99 875 665
左键按下 99 875 665
左键抬起 99 875 665
鼠标移动 99 975 665
左键按下 99 975 665
左键抬起 99 975 665
鼠标移动 99 875 665
左键按下 99 875 665
左键抬起 99 875 665
鼠标移动 99 1075 665
左键按下 99 1075 665
左键抬起 99 1075 665
鼠标移动 99 875 665
左键按下 99 875 665
左键抬起 99 875 665
鼠标移动 99 1175 665
左键按下 99 1175 665
左键抬起 99 1175 665
鼠标移动 99 875 665
左键按下 99 875 665
左键抬起 99 875 665
鼠标移动 99 1240 605
左键按下 99 1240 605
左键抬起 99 1240 605
鼠标移动 99 775 665
左键按下 99 775 665
左键抬起 99 775 665
鼠标移动 99 875 665
左键按下 99 875 665
左键抬起 99 875 665
鼠标移动 99 875 665
左键按下 99 875 665
左键抬起 99 875 665
鼠标移动 99 875 665
左键按下 99 875 665
左键抬起 99 875 665
鼠标移动 99 975 665
左键按下 99 975 665
左键抬起 99 975 665
鼠标移动 99 875 665
左键按下 99 875 665
左键抬起 99 875 665
鼠标移动 99 1075 665
左键按下 99 1075 665
左键抬起 99 1075 665
鼠标移动 99 875 665
左键按下 99 875 665
左键抬起 99 875 665
鼠标移动 99 1175 665
左键按下 99 1175 665
左键抬起 99 1175 665
鼠标移动 99 875 665
左键按下 99 875 665
左键抬起 99 875 665
鼠标移动 99 1240 605
左键按下 99 1240 605
左键抬起 99 1240 605
鼠标移动 99 775 665
左键按下 99 775 665
左键抬起 99 775 665
鼠标移动 99 875 665
左键按下 99 875 665
左键抬起 99 875 665
鼠标移动 99 875 665
左键按下 99 875 665
左键抬起 99 875 665
鼠标移动 99 875 665
左键按下 99 875 665
左键抬起 99 875 665
鼠标移动 99 975 665
左键按下 99 975 665
左键抬起 99 975 665
鼠标移动 99 875 665
左键按下 99 875 665
左键抬起 99 875 665
鼠标移动 99 1075 665
左键按下 99 1075 665
左键抬起 99 1075 665
鼠标移动 99 875 665
左键按下 99 875 665
左键抬起 99 875 665
鼠标移动 99 1175 665
左键按下 99 1175 665
左键抬起 99 1175 665
鼠标移动 99 875 665
左键按下 99 875 665
左键抬起 99 875 665
鼠标移动 99 1240 605
左键按下 99 1240 605
左键抬起 99 1240 605
鼠标移动 99 775 665
左键按下 99 775 665
左键抬起 99 775 665
鼠标移动 99 875 665
左键按下 99 875 665
左键抬起 99 875 665
鼠标移动 99 875 665
左键按下 99 875 665
左键抬起 99 875 665
鼠标移动 99 875 665
左键按下 99 875 665
左键抬起 99 875 665
鼠标移动 99 975 665
左键按下 99 975 665
左键抬起 99 975 665
鼠标移动 99 875 665
左键按下 99 875 665
左键抬起 99 875 665
鼠标移动 99 1075 665
左键按下 99 1075 665
左键抬起 99 1075 665
鼠标移动 99 875 665
左键按下 99 875 665
左键抬起 99 875 665
鼠标移动 99 1175 665
左键按下 99 1175 665
左键抬起 99 1175 665
鼠标移动 99 875 665
左键按下 99 875 665
左键抬起 99 875 665
鼠标移动 99 1240 605
左键按下 99 1240 605
左键抬起 99 1240 605


用python pyqt5库写一个桌面GUI小程序,目标是帮我计算最佳分配方式。
我有n个技能点数,需要分配到各个属性,彼此互相影响,下面讲解每个属性：
最大伤害(每点效果是增加 1%最大伤害,最多1000点),每点需要点数3点。
最小伤害(每点效果是增加 1%最小伤害,最多1000点),每点需要点数3点。
暴击伤害(每点效果是增加 1%暴击伤害,最多1000点),每点需要点数3点。
武器属性力(每点效果是增加 1属性力,最多1000点),每点需要点数3点。
最小伤害换最大伤害(每点效果是最小伤害减少 5%,最大伤害增加 10%,最多250点),每点需要点数3点。
最终暴击伤害(每点效果默认增加 218%暴击伤害(可调整),最多40点),第一点需要2点,以后每点增加5点,也就是第二点需要7点,第三点需要12点以此类推。
最终最小伤害(每点效果默认增加 119%最小伤害(可调整),最多40点),第一点需要2点,以后每点增加5点,也就是第二点需要7点,第三点需要12点以此类推。
最终最大伤害(每点效果默认增加 143%最大伤害(可调整),最多40点),第一点需要2点,以后每点增加5点,也就是第二点需要7点,第三点需要12点以此类推。
超级武器属性力(每点效果默认增加 787属性力(可调整),最多20点),第一点需要10点,以后每点增加10点,也就是第二点需要20点,第三点需要30点以此类推。
最终造成的伤害公式是 属性力*暴击伤害*（最大伤害+最小伤害）/2 最终数值越高则越强
人物初始属性(可调整):
最大伤害初始值 17254%
最小伤害初始值 13289%
暴击伤害初始值 30282%
武器属性力初始值 94459
要求:
1.实际最小伤害不能超过实际最大伤害
2.有计算方案次数显示,尽量少的影响程序计算
3.用协程或者多线程或者异步方式来计算以避免阻塞主线程。
4.考虑PyQt类型转换问题,不要有数值溢出
5.最终属性的效果远比普通属性强大，可以考虑使用动态规划优化
6.尽量优化代码,减少计算时间
7.运用粗略搜索与精调搜索相结合的方式
8.提前剪枝
9.百分比分配策略
10.二分搜索优化最小换最大点数
11.减少迭代次数


狗屎瓜 119.04 528绿 1561红



项王 423领悟 40翅膀