import os
import json
from src.utils.tools import read_json_file, save_json_file, modify_json_data

target_path = r'E:\Game\Chd\小草\心月狐\data\Config'
target_files_path = [
    ["﹎秋水伊人ゞ", "1536622268\\A96DC7EFCBAED2C1C8CBA967"],
    ["晚来天欲雪o", "1536622268\\CDEDC0B4CCECD3FBD1A96F"],
    ["小姐姐", "1536622268\\D7FAD7FAD7FAD7FAD7FAD0A1BDE3BDE3"],
    ["云青青兮欲雨", "1536622268\\D4C6C7E0C7E0D9E2D3FBD3EAFE5D"],
    ["满船清梦压星河Q", "1536622268\\C2FAB4ACC7E5C3CED1B9D0C7BAD351"],
    ["能饮一杯无o", "1536622268\\C4DCD2FBD2BBB1ADCEDE6F"],
    ["醉后不知天在水o", "1536622268\\D7EDBAF3B2BBD6AACCECD4DACBAE6F"],
    ["→酷我音乐→", "1536622268\\A1FABFE1CED2D2F4C0D6A1FA"],
    ["酷狗音乐ā", "1536622268\\BFE1B9B7D2F4C0D6A8A1"],
    ["℃ベ裸装", "1536622268\\A1E6A5D9A8FDA8FDC2E3D7B0"],
    ["终不似o", '1536622268\\D6D5B2BBCBC66F'],
    ["最是人间留不住o", "1536622268\\D7EECAC7C8CBBCE4C1F4B2BBD7A16F"],
    # ["水澹澹兮生烟", "1536622268\\CBAEE5A3E5A3D9E2C9FAD1CCFE5D"],
    # ["少年游o", "1536622268\\C9D9C4EAD3CE6F"],

    ["你到底吻不吻我o", "3387891881\\C4E3B5BDB5D7CEC7B2BBCEC7CED26F"],
    ["来去荒芜", "3387891881\\C0B4C8A5BBC4CEDF"],
    ["不要碰我肩膀", "3387891881\\B2BBD2AAC5F6CED2BCE7B0F2"],
    ["逾白","3387891881\\D3E2B0D7FE5D"],
    ["陌辰","3387891881\\C4B0B3BD"],
    ["我有药", "3387891881\\CED2D3D0D2A9"],
    ["惊觉","3387891881\\BEAABEF5FE5D"],
    ["乙骨犹太","3387891881\\D2D2B9C7D3CCCCAB"],
    ["心缩","3387891881\\D0C4CBF5"],
    ["鸦九","3387891881\\D1BBBEC5"],
    ["烟雨情相思","3387891881\\D7FAD1CCD3EAC7E9CFE0CBBCD7FA"],
    ["荼茶","3387891881\\DDB1B2E8"],
    # ["莫吵","3387891881\\C4AAB3B3"],
    # ["无心梦","3387891881\\CEDED0C4C3CE"],

    # ["自然萌ご", "3476670590\\D7FCD7FCD7D4C8BBC3C8A4B4D7FC"],
    # ["十八岁青春男高", "3476670590\\CAAEB0CBCBEAC7E0B4BAC4D0B8DF"],
    # ["雪绒薄荷ご", "3476670590\\D7FCD7FCD1A9C8DEB1A1BAC9A4B4"],
    # ["傻海我们走~", "3476670590\\C9B5BAA3CED2C3C7D7DF7E"],
    # ["BaLl,", "3476670590\\42614C6C2C"],
    # ["萌萌仓库-格挡","3476670590\\C3C8C3C8B2D6BFE22DB8F1B5B2"],
    # ["萌萌仓库-爆率","3476670590\\C3C8C3C8B2D6BFE22DB1ACC2CA"],
    # ["芝士羊绒ご","3476670590\\D7FCD7FCD6A5CABFD1F2C8DEA4B4"],
    # ["雪绒蓝莓ご","3476670590\\D7FCD7FCD1A9C8DEC0B6DDAEA4B4"],
]
for target_file_path in target_files_path:
    target_file_path = os.path.join(target_path, target_file_path[1])
    target_file_path = os.path.join(target_file_path, 'Default.save')
    target_json_content = read_json_file(target_file_path)
    # 修改 JSON 数据
    key = "store_items"
    new_value = "神炼的多面头戴;上位蛇年小王子帽子;魔法的精粹者徽章+13;魔·冥界之翼;神·圣灵之拥;龙晶[青鸾];祈福同心+9;法老王的巨型宝石戒指;法老王的闪耀耳环;LA-smile-笑脸(男)T恤;LA逐梦系列-夏の阳光(男)帽子;LA逐梦系列-夏の阳光(男)下衣;空灵披风·SPA队长;贪婪耳环;贪婪披风;贪婪戒指;扬卡什胸针;低级血脉水晶(可存仓);中级血脉水晶(可存仓);高级血脉水晶(可存仓);活动时空血脉水晶;红樱桃味全糖蜜果;黄香蕉味全糖蜜果;甜蜜橙味全糖蜜果;合家欢全糖蜜果;恶魔の小果实（雾）;恶魔の小果实（火）;钓鱼王称号书;钓鱼之神称号书;钓鱼达人称号书;钓鱼高手称号书;抽奖王称号;翠绿口香糖;虚实碎片;试炼蝴蝶结;繁星药剂;圣字 魔法伤害减少 重洗卷轴;圣字 武器攻击力 重洗卷轴;圣字 最大生命值 重洗卷轴;文明残页;文明水晶;圣字之火;圣字泛红圣遗物;圣字泛黄圣遗物;圣字泛蓝圣遗物;星海藤;流沙粉钻;卡伊洛斯的标徽;时之花;时之羽;巴巴托斯的长剑锯齿;米凯尔拉的花朵装饰;米凯尔拉的羽毛;巴巴托斯的特制炸弹;水晶流砂;粉晶落叶;文明能量球;自旋星盘;王者腕轮;蔚蓝龙珠;橙黄龙珠;多彩龙珠;抓不住的影子;神秘沙漏;神秘碎片;星星之源;技能强化卷轴;高级召唤兽技能强化卷轴;小天使晶片;创意染色券;淘淘卡;淘淘卡兑换券;创意美发券;梦魇碎块;梦狱碎块;梦之放映机(不可交易);普通武器皮肤激活券;眼睛整容专家券;发型专家券;特殊发型券;特殊晒黑票券;特殊头发颜色券;特殊眼睛整形券;特殊彩色隐形眼镜券;彩虹标徽;春日小花朵;白金锤子;武馆木牌;一级签到方块;二级签到方块;三级签到方块;梦灵成长属性转瓶;梦灵基础属性转瓶;【觉醒】之核;【觉醒II】之核;【传奇】之核;【传奇】之羽;【传奇II】之核;【传奇II】之羽;觉醒·黄金混沌箱子;觉醒·黄金箱子;觉醒·黄金血脉箱子;绵绵冰沙;童心碎片;未知森林伤害皮肤装扮券(永久）;索拉城硬币箱子;索拉城 湛蓝硬币;圣域圣神符文;圣域宝石 宝石魔法锤随机包;圣域宝石 重洗卷轴随机包;塔米埃尔的眼罩;皮酷斯针鞘;皮酷斯的玩偶;皮酷斯缝纫线板;格劳科斯发条键;思奇拉的玩偶帽子;精灵之卵;闪耀翅膀碎片;圣之痕;利卡里亚的斧刃;利卡里亚的盔甲碎片;莫尔迦娜的吊坠;火焰龙的角;莫德雷德的橙色蝴蝶结;金色圣杯;安莎拉腰带装饰;基沙拉假火炬;基沙拉钥匙;安莎拉护手;拉斐拉的羽毛装饰;墨诺提的圣杯;伤痕之花;弥修斯的愤怒;弥修斯的箱子;时间长轴;破碎的驭魂兽精魄[镇寺兽];赫尔之戒碎片;银色石板;银色原石;神秘火苗(双刀);神秘火苗(双手剑);破碎的驭魂兽精魄[瑞贝特];莱菲卡的红色珍宝;格莫瑞族女王的绿色珍宝;莱菲卡服饰兑换券;莱菲卡伤害皮肤装扮券(永久);扬卡什手套碎片;安德利亚之箭;安德利亚之断弓;扬卡什尾巴;格诺西斯的领悟;N4-烬灭武器觉醒之石;N3-烬灭武器觉醒之石;N2-烬灭武器觉醒之石;不完整的魔神撕裂翅膀;格诺西斯的解放;不完整的魔神之角;;;;;;;;;;;;;;;;;;;;;;;突变藤蔓;符文之力;女神雕像;巴比伦金球;太空玫瑰;密文石碑;永恒星辰服饰兑换券;绿洲水晶;遗忘之源;冰凝之蝶;空灵花;不稳定能量阵;时之章;时空服饰兑换券;灵魂的夙愿;破碎的驭魂兽精魄[影魔];;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;复合觉醒石随机包;"
    modified_json = modify_json_data(target_json_content, key, new_value)
    if modified_json:
        # 保存修改后的 JSON 文件
        save_json_file(target_file_path, modified_json, 'gbk')